
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2025.2.288.3.8
# Date: 2026-03-22 22:04

# Copyright (C) 2013 - 2025 Efinix Inc. All rights reserved.

# Device: T20F256
# Project: DSO_project
# Timing Model: C4 (final)

# PLL Constraints
###################
create_clock -period 40.000 -name clk_25m [get_ports {clk_25m}]

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {clk_50m}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {clk_50m}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {key_back_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {key_back_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {key_down_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {key_down_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {key_enter_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {key_enter_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {key_up_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {key_up_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {sys_rst_n}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {sys_rst_n}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~93}] -max 0.610 [get_ports {vga_b[0]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~93}] -min -0.085 [get_ports {vga_b[0]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~91}] -max 0.610 [get_ports {vga_b[1]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~91}] -min -0.085 [get_ports {vga_b[1]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~68}] -max 0.610 [get_ports {vga_b[2]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~68}] -min -0.085 [get_ports {vga_b[2]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~73}] -max 0.610 [get_ports {vga_b[3]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~73}] -min -0.085 [get_ports {vga_b[3]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~38}] -max 0.610 [get_ports {vga_b[4]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~38}] -min -0.085 [get_ports {vga_b[4]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~133}] -max 0.610 [get_ports {vga_g[0]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~133}] -min -0.085 [get_ports {vga_g[0]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~138}] -max 0.610 [get_ports {vga_g[1]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~138}] -min -0.085 [get_ports {vga_g[1]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~108}] -max 0.610 [get_ports {vga_g[2]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~108}] -min -0.085 [get_ports {vga_g[2]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~106}] -max 0.610 [get_ports {vga_g[3]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~106}] -min -0.085 [get_ports {vga_g[3]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~103}] -max 0.610 [get_ports {vga_g[4]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~103}] -min -0.085 [get_ports {vga_g[4]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~98}] -max 0.610 [get_ports {vga_g[5]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~98}] -min -0.085 [get_ports {vga_g[5]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~51}] -max 0.610 [get_ports {vga_hs}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~51}] -min -0.085 [get_ports {vga_hs}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~181}] -max 0.610 [get_ports {vga_r[0]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~181}] -min -0.085 [get_ports {vga_r[0]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~161}] -max 0.610 [get_ports {vga_r[1]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~161}] -min -0.085 [get_ports {vga_r[1]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~176}] -max 0.610 [get_ports {vga_r[2]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~176}] -min -0.085 [get_ports {vga_r[2]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~186}] -max 0.610 [get_ports {vga_r[3]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~186}] -min -0.085 [get_ports {vga_r[3]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~146}] -max 0.610 [get_ports {vga_r[4]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~146}] -min -0.085 [get_ports {vga_r[4]}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~48}] -max 0.610 [get_ports {vga_vs}]
set_output_delay -clock clk_25m -reference_pin [get_ports {clk_25m~CLKOUT~159~48}] -min -0.085 [get_ports {vga_vs}]

# LVDS TX GPIO Constraints
############################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_0}]
